test/bench/evidence/20260714-0936-06dc4acd5/e_write_fsync16-linux-r3.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.296517] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=write rw=write bs=1M nj=1 fsync=16 size=1G
P9CASE write
p9write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread
p9write: Laying out IO file (1 file / 1024MiB)
Jobs: 1 (f=1)
p9write: (groupid=0, jobs=1): err= 0: pid=100: Tue Jul 14 09:52:55 2026
  write: IOPS=951, BW=952MiB/s (998MB/s)(1024MiB/1076msec); 0 zone resets
    clat (usec): min=58, max=980, avg=211.73, stdev=136.55
     lat (usec): min=69, max=1012, avg=230.29, stdev=139.76
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   63], 10.00th=[   68], 20.00th=[   77],
     | 30.00th=[   90], 40.00th=[  137], 50.00th=[  233], 60.00th=[  253],
     | 70.00th=[  269], 80.00th=[  293], 90.00th=[  404], 95.00th=[  486],
     | 99.00th=[  570], 99.50th=[  619], 99.90th=[  775], 99.95th=[  979],
     | 99.99th=[  979]
   bw (  KiB/s): min=913628, max=1017856, per=99.10%, avg=965742.00, stdev=73700.33, samples=2
   iops        : min=  892, max=  994, avg=943.00, stdev=72.12, samples=2
  lat (usec)   : 100=33.89%, 250=24.12%, 500=38.09%, 750=3.71%, 1000=0.20%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=9817, max=52934, avg=13149.08, stdev=5979.28
    sync percentiles (usec):
     |  1.00th=[ 9765],  5.00th=[ 9896], 10.00th=[10028], 20.00th=[10290],
     | 30.00th=[10421], 40.00th=[10552], 50.00th=[10814], 60.00th=[11207],
     | 70.00th=[13042], 80.00th=[16909], 90.00th=[18482], 95.00th=[18744],
     | 99.00th=[52691], 99.50th=[52691], 99.90th=[52691], 99.95th=[52691],
     | 99.99th=[52691]
  cpu          : usr=1.86%, sys=20.74%, ctx=199, majf=0, minf=0
  IO depths    : 1=106.2%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,63 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=952MiB/s (998MB/s), 952MiB/s-952MiB/s (998MB/s-998MB/s), io=1024MiB (1074MB), run=1076-1076msec
P9DONE write
P9ALLDONE
[    2.092820] reboot: Power down