test/bench/evidence/20260714-0936-06dc4acd5/g_direct_write_1m-linux-r2.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.296565] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=directwrite rw=write bs=1M nj=1 fsync=0 size=1G
P9CASE direct-write
p9dwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread
p9dwrite: Laying out IO file (1 file / 1024MiB)

p9dwrite: (groupid=0, jobs=1): err= 0: pid=100: Tue Jul 14 09:47:09 2026
  write: IOPS=2027, BW=2028MiB/s (2126MB/s)(1024MiB/505msec); 0 zone resets
    clat (usec): min=323, max=1972, avg=472.63, stdev=175.51
     lat (usec): min=332, max=2008, avg=491.68, stdev=181.39
    clat percentiles (usec):
     |  1.00th=[  330],  5.00th=[  334], 10.00th=[  338], 20.00th=[  355],
     | 30.00th=[  379], 40.00th=[  388], 50.00th=[  392], 60.00th=[  408],
     | 70.00th=[  465], 80.00th=[  611], 90.00th=[  725], 95.00th=[  824],
     | 99.00th=[ 1045], 99.50th=[ 1106], 99.90th=[ 1614], 99.95th=[ 1975],
     | 99.99th=[ 1975]
   bw (  MiB/s): min= 2030, max= 2030, per=100.00%, avg=2030.00, stdev= 0.00, samples=1
   iops        : min= 2030, max= 2030, avg=2030.00, stdev= 0.00, samples=1
  lat (usec)   : 500=72.17%, 750=20.21%, 1000=6.25%
  lat (msec)   : 2=1.37%
  cpu          : usr=3.77%, sys=4.96%, ctx=1025, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2028MiB/s (2126MB/s), 2028MiB/s-2028MiB/s (2126MB/s-2126MB/s), io=1024MiB (1074MB), run=505-505msec
P9DONE direct-write
P9ALLDONE
[    2.210978] reboot: Power down